# read csv

In [48]:
import numpy as np 
import pandas as pd

In [49]:
type(pd.read_csv('../8_files/subs.csv'))

pandas.core.frame.DataFrame

# with one column

In [50]:
data = pd.read_csv('../8_files/subs.csv')
data

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

# with two column

In [51]:
cricket = pd.read_csv('../8_files/kohli_ipl.csv',index_col='match_no')
cricket

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

In [52]:
movie = pd.read_csv('../8_files/bollywood.csv',index_col='movie')
movie

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]

# methods

### head()

In [53]:
movie.head()

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar

In [54]:
# if we pass number in head so it will return number of data to head 
data.head(6)

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44
5                  46

# tail()

In [55]:
data.tail()

     Subscribers gained
360                 231
361                 226
362                 155
363                 144
364                 172

In [56]:
# if we pass number in tail so it will return number of data to tail 
data.tail(10)

     Subscribers gained
355                 149
356                 156
357                 177
358                 210
359                 209
360                 231
361                 226
362                 155
363                 144
364                 172

# sample( ) --- > it will return the 1 random row

In [57]:
data.sample()

     Subscribers gained
314                 150

# valuecount() -- > it will return the count of value

In [58]:
movie.value_counts()

lead
Akshay Kumar        48
Amitabh Bachchan    45
Ajay Devgn          38
Salman Khan         31
Sanjay Dutt         26
                    ..
Kashmira Shah        1
Kartik Elangovan     1
Karisma Kapoor       1
Karan Sharma         1
Zulfi Sayed          1
Name: count, Length: 566, dtype: int64

# sort_values()  --- > sort the value default assending

In [62]:
cricket.sort_values(by='runs',ascending=False).head(1).values[0]

array([113])

In [63]:
movie.sort_index()

                                        lead
movie
1920 (film)                 Rajniesh Duggall
1920: London                   Sharman Joshi
1920: The Evil Returns           Vicky Ahuja
1971 (2007 film)              Manoj Bajpayee
2 States (2014 film)            Arjun Kapoor
...                                      ...
Zindagi 50-50                    Veena Malik
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi Tere Naam         Mithun Chakraborty
Zokkomon                     Darsheel Safary
Zor Lagaa Ke...Haiya!          Meghan Jadhav

[1500 rows x 1 columns]